Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailWarning Property
 Fabrication Part Fitting Failed to Fit
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationPartFitFailWarning { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartFitFailWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationPartFitFailWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace